// Author: Zoo
//	QQ：276793422
//
//	当前工程是个跨平台的内存池，
//	主要目的是为了减少内存碎片的出现，
//	主要是支持跨平台，
//	支持内部自己管理内存，
//	当然了，其实，这个内存池并不是非常安全，
//	但是如果真的想做坏事，堆还能溢出呢
//	
//	目前符合我的使用需求，所以就先留这么个版本
//
//
//				内存池,内存分布图
//
//			实现方法，把空闲内存穿链表
//			申请内存，从空闲内存里面寻找
//			如果空闲内存里面的内存不足，或者申请内存过长，直接一次性向操作系统获取足够长度的内存
//
//
//	SYSTEM_MEMORY_POOL
//		每个池内部内存分布方式
//	----------------------------------------------------------------------------------------------------------------------------
//	|     |     |     |                                                                                                        |
//	|  1  |  2  |  3  |  4                                                                                                     |
//	|     |     |     |                                                                                                        |
//	----------------------------------------------------------------------------------------------------------------------------
//
//		1 ：当前池块与全局链表关联的成员			point
//		2 ：当前池块内部未被分配的链表头节点		head
//		3 ：当前池块的总大小						length
//		4 ：当前池块的数据域						buf
//
//
//
//	FREE_MEMORY_POOL
//		每个空闲空间内部的内存分布
//	--------------------------------------
//	|  5  |  6  |  7                     |
//	--------------------------------------
//
//		5 ：当前空闲空间与所在池关联的链表成员		point
//		6 ：当前空闲空间的总大小					length
//		7 ：当前空闲空间的数据域					start
//
//
//
//	SYSTEM_MEMORY_POOL
//		单个池内，整体内存分布，包括已经被使用的，以及还没被使用的
//	----------------------------------------------------------------------------------------------------------------------------
//	|   |   |   |   | -------------------- |                   | -------------------- |                 | -------------------- |
//	| 1 | 2 | 3 | 4 | | 5 | 6 | 7        | | 8                 | | 5 | 6 | 7        | | 8               | | 5 | 6 | 7        | |
//	|   |   |   |   | -------------------- |                   | -------------------- |                 | -------------------- |
//	----------------------------------------------------------------------------------------------------------------------------
//
//		8 ：已经被分配出去的空间
//
//
//
//	SYSTEM_MEMORY_POOL
//		多个池内，整体内存分布，包括已经被使用的，以及各链表关联关系
//
//		0	：这是整个内存池的链表头
//
//	----------------------------------------------------------------------------------------------------------------------------
//	|   |   |   |   | -------------------- |                   | -------------------- |                 | -------------------- |
//	| 1 | 2 | 3 | 4 | | 5 | 6 | 7        | | 8                 | | 5 | 6 | 7        | | 8               | | 5 | 6 | 7        | |
//	|   |   |   |   | -------------------- |                   | -------------------- |                 | -------------------- |
//	----------------------------------------------------------------------------------------------------------------------------
//
//	----------------------------------------------------------------------------------------------------------------------------
//	|   |   |   |   | -------------------- |                   | -------------------- |                 | -------------------- |
//	| 1 | 2 | 3 | 4 | | 5 | 6 | 7        | | 8                 | | 5 | 6 | 7        | | 8               | | 5 | 6 | 7        | |
//	|   |   |   |   | -------------------- |                   | -------------------- |                 | -------------------- |
//	----------------------------------------------------------------------------------------------------------------------------
//
//	----------------------------------------------------------------------------------------------------------------------------
//	|   |   |   |   | -------------------- |                   | -------------------- |                 | -------------------- |
//	| 1 | 2 | 3 | 4 | | 5 | 6 | 7        | | 8                 | | 5 | 6 | 7        | | 8               | | 5 | 6 | 7        | |
//	|   |   |   |   | -------------------- |                   | -------------------- |                 | -------------------- |
//	----------------------------------------------------------------------------------------------------------------------------
//
//	所有池的 1 与 0 关联
//	每个池的所有 5 ，与自身所在池的 2 关联
//
//
//	即便整块内存被分配出去，整块内存里面至少要有一个链表元素，说明自己内部的空闲空间为0
//	只要内存块存在，就不允许自己内部的头节点是个空链表
//
//	特殊情况，当表里面只有一块内存，且内存被分配出去的情况
//	----------------------------------------------------------------------------------------------------------------------------
//	|   |   |   |   | ------------- |                                                                                          |
//	| 1 | 2 | 3 | 4 | | 5 | 6 | 7 | | 8                                                                                        |
//	|   |   |   |   | ------------- |                                                                                          |
//	----------------------------------------------------------------------------------------------------------------------------
//
//	这时 7 的大小为0，也就是6的值为0
//	5 依然与 2 相联，但是整个表只有一个元素了
//

#pragma once


typedef void * PVOID;
typedef unsigned long ULONG;
typedef unsigned int size_t;
#ifndef NULL
#define NULL (0)
#endif




typedef PVOID (*ZooTypeFunc_MemPool_AllocMemory)(ULONG uLen);

typedef PVOID (*ZooTypeFunc_MemPool_FreeMemory)(PVOID memory);

typedef struct _ZOO_MEMPOOL_FUNCTION 
{
	ZooTypeFunc_MemPool_AllocMemory AllocMemory;
	ZooTypeFunc_MemPool_FreeMemory FreeMemory;
}ZOO_MEMPOOL_FUNCTION, *PZOO_MEMPOOL_FUNCTION;

//
//	函数名：
//		Zoo_MemPool_Init
//	函数功能：
//		初始化内存池
//	参数：
//		p			返回的内存池对象
//		length		初始化内存池长度
//	返回值：
//		正确执行返回0
//		错误之行返回非0
//
int Zoo_MemPool_Init(PVOID *p, unsigned int length, PZOO_MEMPOOL_FUNCTION zmf);

//
//	函数名：
//		Zoo_MemPool_Destory
//	函数功能：
//		释放内存池
//	参数：
//		无
//	返回值：
//		正确执行返回0
//		错误之行返回非0
//
int Zoo_MemPool_Destory(PVOID *p);

//
//	函数名：
//		Zoo_MemPool_Malloc
//	函数功能：
//		向池申请内存
//	参数：
//		unSize		要申请的内存长度
//	返回值
//		正确执行返回非0
//		错误执行返回0
//
void * Zoo_MemPool_Malloc(PVOID p, unsigned int unSize);

//
//	函数名：
//		Zoo_MemPool_Free
//	函数功能：
//		把从池申请的内存释放回池中
//	参数：
//		buffer		从池中获取的内存首地址
//	返回值：
//		正确执行返回0
//		错误之行返回非0
//
int Zoo_MemPool_Free(PVOID p, void *buffer);